3A/CS349/MVC.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-25 Sun 02:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MVC</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">MVC</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbefbb29">1. Benefits of MVC</a>
<ul>
<li><a href="#orgfa33a16">1.1. Benefits</a></li>
<li><a href="#org948d69f">1.2. Multiple View Synchronization</a></li>
</ul>
</li>
<li><a href="#org2f1cb43">2. Implementation</a>
<ul>
<li><a href="#org6160d57">2.1. Adaptations to Pure MVC</a></li>
<li><a href="#orgcc764c8">2.2. Optimizing View Updates</a></li>
</ul>
</li>
<li><a href="#org8e87a5b">3. MVC Variants</a>
<ul>
<li><a href="#org6064682">3.1. Model-View-Presenter</a></li>
<li><a href="#org0f50cf1">3.2. Model-View-ViewModel</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbefbb29" class="outline-2">
<h2 id="orgbefbb29"><span class="section-number-2">1.</span> Benefits of MVC</h2>
<div class="outline-text-2" id="text-1">
<p>
Became a standard design pattern for GUIs.
</p>

<p>
Used for overall app design and individual components.
</p>

<p>
Variants include model-view-presenter, model-view-adapter, and model-view-viewmodel.
</p>
</div>
<div id="outline-container-orgfa33a16" class="outline-3">
<h3 id="orgfa33a16"><span class="section-number-3">1.1.</span> Benefits</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Separate data, state, and business logic from UI: ideally, view and controller
implementations can change without changing model implementation</li>
<li>Supports multiple views of same data</li>
<li>Separation of concerns in code for code reuse and unit testing.</li>
</ol>
</div>
</div>
<div id="outline-container-org948d69f" class="outline-3">
<h3 id="org948d69f"><span class="section-number-3">1.2.</span> Multiple View Synchronization</h3>
<div class="outline-text-3" id="text-1-2">
<p>
When one view changes, others should as well.
</p>

<p>
Done by defining a single model that provides info to multiple views.
</p>
</div>
</div>
</div>
<div id="outline-container-org2f1cb43" class="outline-2">
<h2 id="org2f1cb43"><span class="section-number-2">2.</span> Implementation</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Model</b>: manages application data and its modification
</p>

<p>
<b>View</b>: manages interface to present data
</p>

<p>
<b>Controller</b>: manages interaction to modify data
</p>

<p>
Observer pattern for model (subject) and views (observer).
</p>

<p>
In theory, view and controller and separate and loosely coupled, but in practice
they are tightly coupled.
</p>
</div>
<div id="outline-container-org6160d57" class="outline-3">
<h3 id="org6160d57"><span class="section-number-3">2.1.</span> Adaptations to Pure MVC</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>view and controller are combined so that users view data and provide input in
the same places and since some data manipulations should not be done in the
model (input validation)</li>
<li>multiple models that have data specific to a view</li>
</ol>
</div>
</div>
<div id="outline-container-orgcc764c8" class="outline-3">
<h3 id="orgcc764c8"><span class="section-number-3">2.2.</span> Optimizing View Updates</h3>
<div class="outline-text-3" id="text-2-2">
<p>
On each view update, everything in every view is refreshed from the model.
</p>

<p>
There could be a param to view update that indicates what changed though
simpler is better so avoid early optimization.
</p>
</div>
</div>
</div>
<div id="outline-container-org8e87a5b" class="outline-2">
<h2 id="org8e87a5b"><span class="section-number-2">3.</span> MVC Variants</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org6064682" class="outline-3">
<h3 id="org6064682"><span class="section-number-3">3.1.</span> Model-View-Presenter</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>Presenter</b>: middle-man between model and view that determines how data should
be handled
</p>

<p>
Presenter is often used a broker with multiple views to determine which view
should respond to data.
</p>

<p>
Presenter effectively acts as a supervising controller.
</p>
</div>
</div>
<div id="outline-container-org0f50cf1" class="outline-3">
<h3 id="org0f50cf1"><span class="section-number-3">3.2.</span> Model-View-ViewModel</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>ViewModel</b>: mediates between model and view to manage view&rsquo;s display logic so
that only display-independent logic is related to model
</p>

<p>
Useful in scenarios where state is view-dependent.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-25 Sun 02:38</p>
</div>
</body>
</html>
